In [1]:
import pandas as pd

In [6]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
df = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

In [14]:
df

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [11]:
df.to_csv('myDataFrame.csv')

In [15]:
file_name = '/Users/amardip.kumar/Desktop/1.csv'

In [19]:
data = {'Country': ['Belgium',  'India',  'Brazil'],'Capital': ['Brussels',  'New Delhi',  'Brasilia'],'Population': [11190846, 1303171035, 207847528]}

In [20]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [21]:
df = pd.DataFrame(data,columns=['Country',  'Capital',  'Population'])

In [22]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [23]:
df.to_csv('1.csv')

In [25]:
pd.read_csv('1.csv')

   Unnamed: 0  Country    Capital  Population
0           0  Belgium   Brussels    11190846
1           1    India  New Delhi  1303171035
2           2   Brazil   Brasilia   207847528

In [27]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [30]:
df[]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [31]:
df['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object